src/Catalogs/ПоказателиAPDEX/ПоказателиAPDEX.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПоказателиAPDEX</name>
  <owners>Catalog.ПоказателиМониторинга</owners>
  <owners>Catalog.ПоказателиОповещений</owners>
  <owners>Catalog.ПоказателиИнцидентов</owners>
  <attributes>
    <name>НаименованиеТипаПоказателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТренд</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодAPDEX</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменился</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменилсяВид</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоМасштаб</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСпискаПользователей</name>
    <type>
      <types>EnumRef.ТипыСпискаПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменилосьСглаживание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказатьДанныеЗаПрошлыйПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВременноеСмещение</name>
    <type>
      <types>EnumRef.ВариантыСмещенияВременногоОкна</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСглаживания</name>
    <type>
      <types>EnumRef.ТипыСглаживания</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоказателя</name>
    <type>
      <types>EnumRef.ТипыПоказателейПроизводительности</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоХудшихЗамеров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогПревышенияЦелевогоВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДельтаСреднееВремяЗамера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоЗамеров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаВыборки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>ИмяПользователя</name>
      <type>
        <types>CatalogRef.ПользователиЗамерПроизводительности</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьИмяПользователя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КлючевыеОперации</name>
    <attributes>
      <name>ИдентификаторКлючевойОперации</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнформационнаяБаза</name>
      <type>
        <types>CatalogRef.ОбъектыКонтроля</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьИдентификаторКлючевойОперации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/ОценкаПроизводительностиКлючевыеОперации/ОценкаПроизводительностиКлючевыеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОценкаПроизводительностиКлючевыеОперации</name>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦелевоеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МинимальноДопустимыйУровень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПриоритетВИБ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦелевоеВремяВИБ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВыполненаСОшибкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПомеченаНаУдаление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ТипыСпискаПользователей/ТипыСпискаПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСпискаПользователей</name>
  <enumValues>
    <name>Все</name>
  </enumValues>
  <enumValues>
    <name>ВсеКроме</name>
  </enumValues>
  <enumValues>
    <name>ТолькоУказанные</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ТипыПоказателейПроизводительности/ТипыПоказателейПроизводительности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПоказателейПроизводительности</name>
  <enumValues>
    <name>APDEX</name>
  </enumValues>
  <enumValues>
    <name>СреднееВремяХудшихЗамеров</name>
  </enumValues>
  <enumValues>
    <name>КоличествоОперацийПревышенияЦелевогоВремени</name>
  </enumValues>
  <enumValues>
    <name>ПроцентПользователейПревышенияЦелевогоВремени</name>
  </enumValues>
  <enumValues>
    <name>ПроцентПользователейИзмененияЦелевогоВремени</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ПоказателиAPDEX/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолучитьМассивСтруктурыПоказателей(ТипПоказателя, ИдентификаторНастройки, МассивСтруктурПоказателей, ТолькоВыбранные) Экспорт
	
	МассивСтруктурыПоказателей = Новый Массив;
	
	ТаблицаПоказателей = Новый ТаблицаЗначений;
	ТаблицаПоказателей.Колонки.Добавить("ПоказательМониторинга", Новый ОписаниеТипов("СправочникСсылка.ПоказателиМониторинга"));
	ТаблицаПоказателей.Колонки.Добавить("ГруппаОбъектовКонтроля", Новый ОписаниеТипов("Булево"));
	
	Для Каждого СтруктураПоказатель Из МассивСтруктурПоказателей Цикл
		
		Если ЗначениеЗаполнено(СтруктураПоказатель.Показатель) И СтруктураПоказатель.ТипПоказателя = "ПоказателиAPDEX" Тогда
			
			НоваяСтрока							= ТаблицаПоказателей.Добавить();
			НоваяСтрока.ПоказательМониторинга	= СтруктураПоказатель.Показатель;
			НоваяСтрока.ГруппаОбъектовКонтроля	= СтруктураПоказатель.ГруппаОбъектовКонтроля;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ИдентификаторНастройки", ИдентификаторНастройки);
	Запрос.УстановитьПараметр("ТаблицаПоказателей", ТаблицаПоказателей);
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаПоказателей.ПоказательМониторинга КАК ПоказательМониторинга,
	|	ТаблицаПоказателей.ГруппаОбъектовКонтроля КАК ГруппаОбъектовКонтроля
	|ПОМЕСТИТЬ
	|	ТаблицаПоказателей
	|ИЗ
	|	&ТаблицаПоказателей КАК ТаблицаПоказателей
	|
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаПоказателей.ПоказательМониторинга.Наименование Как Код,
	|	ТаблицаПоказателей.ПоказательМониторинга КАК ПоказательМониторинга
	|ИЗ
	|	ТаблицаПоказателей КАК ТаблицаПоказателей
	|ГДЕ
	|	ТаблицаПоказателей.ГруппаОбъектовКонтроля
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код
	|";
	
	СтруктураДанныхГруппы = Новый Структура();
	СтруктураДанныхГруппы.Вставить("ПоказательМониторинга", "");
	СтруктураДанныхГруппы.Вставить("ОбъектКонтроля", "ГруппаОбъектовКонтроляРодитель");
	СтруктураДанныхГруппы.Вставить("Код", "Группы APDEX");
	СтруктураДанныхГруппы.Вставить("МассивСтрок", Новый Массив());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтруктураДанных = Новый Структура();
		СтруктураДанных.Вставить("ПоказательМониторинга", Строка(Выборка.ПоказательМониторинга.УникальныйИдентификатор()));
		СтруктураДанных.Вставить("ОбъектКонтроля", "ГруппаОбъектовКонтроля");
		СтруктураДанных.Вставить("Код", Выборка.Код);
		СтруктураДанных.Вставить("МассивСтрок", Новый Массив());
		
		СтруктураДанныхГруппы.МассивСтрок.Добавить(СтруктураДанных);
		
	КонецЦикла;
	
	МассивСтруктурыПоказателей.Добавить(СтруктураДанныхГруппы);
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	БазыОперации.ИнформационнаяБаза.Наименование КАК БазаНаименование,
	|	БазыОперации.ИнформационнаяБаза КАК ОбъектКонтроля,
	|	БазыОперации.УникальныйИдентификатор КАК КлючеваяОперация,
	|	БазыОперации.Имя КАК КлючеваяОперацияНаименование,
	|	ЕСТЬNULL(ТаблицаПоказателей.ПоказательМониторинга, Неопределено) КАК ПоказательМониторинга
	|ИЗ
	|	РегистрСведений.ОценкаПроизводительностиКлючевыеОперации КАК БазыОперации
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПоказателиAPDEX.КлючевыеОперации КАК ПоказателиAPDEX
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПоказателей КАК ТаблицаПоказателейОтбор
	|		ПО ТаблицаПоказателейОтбор.ПоказательМониторинга.Показатель = ПоказателиAPDEX.Ссылка
	|		И НЕ ТаблицаПоказателейОтбор.ГруппаОбъектовКонтроля
	|
	|	ПО ПоказателиAPDEX.ИнформационнаяБаза = БазыОперации.ИнформационнаяБаза
	|	И ПоказателиAPDEX.ИдентификаторКлючевойОперации = БазыОперации.УникальныйИдентификатор
	|	И ПоказателиAPDEX.Ссылка.ТипСпискаПользователей = ЗНАЧЕНИЕ(Перечисление.ТипыСпискаПользователей.Все)
	|	И ПоказателиAPDEX.Ссылка.ТипПоказателя = ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейПроизводительности.APDEX)
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПоказателей КАК ТаблицаПоказателей
	|	ПО ТаблицаПоказателей.ПоказательМониторинга.Показатель = ПоказателиAPDEX.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	БазаНаименование,
	|	КлючеваяОперацияНаименование
	|
	|ИТОГИ 
	|	МАКСИМУМ(ПоказательМониторинга) КАК ПоказательМониторинга
	|ПО
	|	ОбъектКонтроля
	|";
	
	ВыборкаБаза = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ОбъектКонтроля");
	Пока ВыборкаБаза.Следующий() Цикл
		
		Если ТолькоВыбранные И НЕ ЗначениеЗаполнено(ВыборкаБаза.ПоказательМониторинга) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураДанныхБаза = Новый Структура();
		СтруктураДанныхБаза.Вставить("ПоказательМониторинга", "");
		СтруктураДанныхБаза.Вставить("Код", ВыборкаБаза.БазаНаименование);
		СтруктураДанныхБаза.Вставить("ОбъектКонтроля", Строка(ВыборкаБаза.ОбъектКонтроля.УникальныйИдентификатор()));
		СтруктураДанныхБаза.Вставить("МассивСтрок", Новый Массив());
		
		ВыборкаКлючеваяОперация = ВыборкаБаза.Выбрать();
		Пока ВыборкаКлючеваяОперация.Следующий() Цикл
		
			Если ТолькоВыбранные И НЕ ЗначениеЗаполнено(ВыборкаКлючеваяОперация.ПоказательМониторинга) Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураДанныхКлючеваяОперация = Новый Структура();
			
			Если ЗначениеЗаполнено(ВыборкаКлючеваяОперация.ПоказательМониторинга) Тогда
				СтруктураДанныхКлючеваяОперация.Вставить("ПоказательМониторинга", Строка(ВыборкаКлючеваяОперация.ПоказательМониторинга.УникальныйИдентификатор()));
			Иначе
				СтруктураДанныхКлючеваяОперация.Вставить("ПоказательМониторинга", "");
			КонецЕсли;
			
			СтруктураДанныхКлючеваяОперация.Вставить("Код", ВыборкаКлючеваяОперация.КлючеваяОперацияНаименование);
			СтруктураДанныхКлючеваяОперация.Вставить("ОбъектКонтроля", Строка(ВыборкаКлючеваяОперация.ОбъектКонтроля.УникальныйИдентификатор()) + "/" + Строка(ВыборкаКлючеваяОперация.КлючеваяОперация));
			СтруктураДанныхКлючеваяОперация.Вставить("МассивСтрок", Новый Массив());
			
			СтруктураДанныхБаза.МассивСтрок.Добавить(СтруктураДанныхКлючеваяОперация);
			
		КонецЦикла;
		
		МассивСтруктурыПоказателей.Добавить(СтруктураДанныхБаза);
		
	КонецЦикла;
	
	Возврат МассивСтруктурыПоказателей;
	
КонецФункции

Функция ПоискПоказателей(Знач СтрокаПоиска) Экспорт
	
	СтрокаПоиска = СтрЗаменить(СтрокаПоиска, """", "");
	
	МассивРезультатов = Новый Массив;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СтрокаПоиска", "%" + СтрокаПоиска + "%");
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	""APDEX/"" + БазыОперации.ИнформационнаяБаза.Наименование + ""/"" + БазыОперации.Имя КАК Представление,
	|	БазыОперации.ИнформационнаяБаза КАК ОбъектКонтроля,
	|	БазыОперации.УникальныйИдентификатор КАК КлючеваяОперация
	|ИЗ
	|	РегистрСведений.ОценкаПроизводительностиКлючевыеОперации КАК БазыОперации
	|
	|ГДЕ
	|	(БазыОперации.ИнформационнаяБаза.Наименование + ""/"" + БазыОперации.Имя) ПОДОБНО &СтрокаПоиска
	|
	|УПОРЯДОЧИТЬ ПО
	|	Представление
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтруктураРезультата = Новый Структура();
		СтруктураРезультата.Вставить("Представление", Выборка.Представление);
		СтруктураРезультата.Вставить("ОбъектКонтроля", Строка(Выборка.ОбъектКонтроля.УникальныйИдентификатор()) + "/" + Строка(Выборка.КлючеваяОперация));
		СтруктураРезультата.Вставить("ТипПоказателя", "ПоказателиAPDEX");
		
		МассивРезультатов.Добавить(СтруктураРезультата);
		
	КонецЦикла;
	
	Возврат МассивРезультатов;
	
КонецФункции

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Описание
	|ИЗ
	|	Справочник.ПоказателиAPDEX
	|ГДЕ
	|	Ссылка = &Ссылка
	|";
	Запрос.УстановитьПараметр("Ссылка", Данные.Ссылка);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Представление = Выборка.Описание;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецЕсли
